## Ejercicio pandas 2

In [17]:
import numpy as np
import pandas as pd

### Ejercicio 0:
- Carga ambos archivos **`titanic_1.csv`** y **`titanic_2.csv`** y guardalos en **`df1`** y **`df2`** respectivamente:

In [18]:
df1 = pd.read_csv("Data/titanic_1.csv")
df2 = pd.read_csv("Data/titanic_2.csv")

### Ejercicio 1:
- Mostrar las estadisticas de cada uno de los DataFrames.

### Ejercicio 2:
- Unir los DataFrames para obtener solo uno.

In [21]:
pd.concat([df1, df2], axis = 1)

,PassengerId,Name,Sex,Age,PassengerId,Survived,Pclass,Ticket,Fare
0,1,"Braund, Mr. Owen Harris",male,22.0,1,0,3,A/5 21171,7.2500
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,2,1,1,PC 17599,71.2833
2,3,"Heikkinen, Miss. Laina",female,26.0,3,1,3,STON/O2. 3101282,7.9250
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,4,1,1,113803,53.1000
4,5,"Allen, Mr. William Henry",male,35.0,5,0,3,373450,8.0500
...,...,...,...,...,...,...,...,...,...
886,887,"Montvila, Rev. Juozas",male,27.0,887,0,2,211536,13.0000
887,888,"Graham, Miss. Margaret Edith",female,19.0,888,1,1,112053,30.0000
888,889,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,889,0,3,W./C. 6607,23.4500
889,890,"Behr, Mr. Karl Howell",male,26.0,890,1,1,111369,30.0000
890,891,"Dooley, Mr. Patrick",male,32.0,891,0,3,370376,7.7500

In [26]:
df = pd.merge(left = df1, right = df2, on = "PassengerId", how = "inner")

### Ejercicio 3:
- Imprimir las últimas 5 filas de las columnas de nombre y edad

In [32]:
df[['Name', 'Age']].tail(5)

                                         Name   Age
886                     Montvila, Rev. Juozas  27.0
887              Graham, Miss. Margaret Edith  19.0
888  Johnston, Miss. Catherine Helen "Carrie"   NaN
889                     Behr, Mr. Karl Howell  26.0
890                       Dooley, Mr. Patrick  32.0

### Ejercicio 4:
- Imprimir las primeras 10 filas de las instancias que en sexo sean igual a femenino.

In [35]:
df[df['Sex'] == "female"].head(10)

,PassengerId,Name,Sex,Age,Survived,Pclass,Ticket,Fare
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,1,PC 17599,71.2833
2,3,"Heikkinen, Miss. Laina",female,26.0,1,3,STON/O2. 3101282,7.9250
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,1,113803,53.1000
8,9,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,1,3,347742,11.1333
9,10,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,2,237736,30.0708
10,11,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,3,PP 9549,16.7000
11,12,"Bonnell, Miss. Elizabeth",female,58.0,1,1,113783,26.5500
14,15,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0,0,3,350406,7.8542
15,16,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,1,2,248706,16.0000
18,19,"Vander Planke, Mrs. Julius (Emelia Maria Vande...",female,31.0,0,3,345763,18.0000

### Ejercicio 5:
- Imprimir las instancias que en la columna **`Fare`** sean menor a 33 y en la columna **`Pclass`** igual a 2.

In [39]:
df_2 = df[ (df['Fare'] < 33) & (df['Pclass'] == 2) ]

In [40]:
df_2

,PassengerId,Name,Sex,Age,Survived,Pclass,Ticket,Fare
9,10,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,2,237736,30.0708
15,16,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,1,2,248706,16.0000
17,18,"Williams, Mr. Charles Eugene",male,NaN,1,2,244373,13.0000
20,21,"Fynney, Mr. Joseph J",male,35.0,0,2,239865,26.0000
21,22,"Beesley, Mr. Lawrence",male,34.0,1,2,248698,13.0000
...,...,...,...,...,...,...,...,...
866,867,"Duran y More, Miss. Asuncion",female,27.0,1,2,SC/PARIS 2149,13.8583
874,875,"Abelson, Mrs. Samuel (Hannah Wizosky)",female,28.0,1,2,P/PP 3381,24.0000
880,881,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,1,2,230433,26.0000
883,884,"Banfield, Mr. Frederick James",male,28.0,0,2,C.A./SOTON 34068,10.5000
886,887,"Montvila, Rev. Juozas",male,27.0,0,2,211536,13.0000

### Ejercicio 6:
- Del resultado anterior obten el número de hombres y el número de mujeres.

In [42]:
df_2['Sex'].value_counts()

Sex
male      95
female    68
Name: count, dtype: int64

In [45]:
df[ (df['Fare'] < 33) & (df['Pclass'] == 2) ]['Sex'].value_counts()

Sex
male      95
female    68
Name: count, dtype: int64

In [46]:
df['Sex'][ (df['Fare'] < 33) & (df['Pclass'] == 2)].value_counts()

Sex
male      95
female    68
Name: count, dtype: int64

### Ejercicio 7:
- Obten el costo total de los tickets de hombres y el costo total de los tickets de mujeres.

In [54]:
sexs = df['Sex'].unique()

coste_total_por_sexo = {}

for sex in sexs:
    total = df[df['Sex'] == sex]['Fare'].sum()
    coste_total_por_sexo[sex] = total

### Ejercicio 8:
- Obten el costo total de los tickets por cada clase (1, 2 y 3) y el número de pasajeros de cada clase.

In [61]:
pclasses = df['Pclass'].unique()

data = []

for pclass in pclasses:
    df_temp = df[df['Pclass'] == pclass]
    total_pasajeros = len(df_temp)
    total_fare = df_temp['Fare'].sum()

    data.append([pclass, total_pasajeros, total_fare])

In [64]:
pd.DataFrame(data, columns = ['Pclass', 'Pasajeros', 'Total'])

   Pclass  Pasajeros       Total
0       3        491   6714.6951
1       1        216  18177.4125
2       2        184   3801.8417

In [69]:
df.groupby("Pclass")['Fare'].sum()

180 µs ± 1.51 µs per loop (mean ± std. dev. of 7 runs, 10,000 loops each)

### Ejercicio 9:
- Crear una columna con el apellido de cada pasajero y agregala al DataFrame.

### Ejercicio 10:
- Encuentra si se repiten apellidos en la columna que se creo en el ejercicio anterior. (Usa .value_counts())

### Ejercicio 11:
- Encuentra los apellidos que se repiten en la columna recien creada. Es decir, solo muestra los apellidos que aparecen más de 1 vez.

### Ejercicio 12:
- Imprime los primeros 10 pasajeros que tengan un **`PassengerID`** multiplo de 3.

### Ejercicio 13:
- ¿Cuales son los apellidos de los pasajeros que son mujeres y menores de 20 años?

### Ejercicio 14:
- ¿Cuales son los apellidos de los pasajeros que son hombres y mayor de 45 años?

### Ejercicio 15:
- Compara si coinciden los apellidos generados en los ejercicios anteriores.

### Ejercicio 16:
- Encuentra los 10 pasajeros que no sobrevivieron más jovenes e imprime cuantos son hombres y cuantos son mujeres.

### Ejercicio 17:
-  En un DataFrame muestra 3 pasajeros que sean hombres y 3 que sean mujeres, que hayan sobrevivido y para cada clase de la columna Pclass.

### Ejercicio 18:
- Obtener el tipo de elementos de cada columna y convierte los que sean "int64" a "int32". Evalua la memoria que consume antes y después de convertir las columnas y comenta la diferencia.

### Ejercicio 19:
- Encuentra a los pasajeros de la clase 1 y 3 entre 20 y 25 años y comprueba si son más hombres o mujeres.

### Ejercicio 20:
- Agrega una nueva columna al DataFrame que se llame: "Rango edad" y va a categorizar de la siguiente manera:
    - Niño < 11 años
    - Joven < 18 años
    - Adulto < 50 años
    - Mayor >= 50 años

### Ejercicio 21:
- Encontrar a los pasajeros "jovenes" y "mayores" de la clase 2 y 3 que hayan sobrevivido. Imprimir los 10 primeros.

### Ejercicio 22:
- Encuentra la edad promedio de todos los pasajeros y reemmplazala por los NaN en la columna de Age y ejecuta el ejercicio anterior.

### Ejercicio 23:
- Cambia a español la columna **`Sex`**.

### Ejercicio 24:
- Convierte a mayusculas todas las columnas que los valores sean cadenas.

### Ejercicio 25:
- Agrupa por sexo y rango de edad y encuentra la edad promedio.

### Ejercicio 26:
- Divide la columna name en las siguientes columnas:
    - Mrs/Miss
    - Apellido
    - Nombre(s)
    
**Nota: Ignora el resto de información.**